# Тестовое задание на вакансию "Инженер-разработчик по финансовым системам (Python)"

## Задание 1

Реализуйте итератор по данной UML-диаграмме:

UML-диаграмма
returns
InterestInput
+period: int
+date1: date
+date2: date
+withdraw: Decimal
+max_return: Decimal
+rate: Decimal

InterestIterator
-withdraw: dict[int,Decimal]
-max_return: dict[int,Decimal]
-rate: Decimal
-dates: dict[int,date]
+iter() : Iterator
+next() : InterestInput


### Описание параметров

Итератор получает на вход:

| Параметр | Смысл |
| --- | --- |
| withdraw | Суммы, которые получает клиент по кредиту в соответствующем периоде |
| max_return | Максимальная сумма, которую клиент может вернуть в соответствующем периоде |
| rate | Ставка кредита |
| dates | Даты платежей по кредиту |

InterestInput содержит следующее:

| Параметр | Смысл |
| --- | --- |
| period | Номер периода |
| date1 | Дата начала периода |
| date2 | Дата конца периода |
| withdraw | Сумма, которую получает клиент по кредиту в данном периоде |
| max_return | Максимальная сумма, которую клиент может вернуть в данном периоде |
| rate | Ставка кредита |

### Доп.условия

- Атрибуты InterestInput должны быть доступны через дескриптор
- Итератор должен использовать как можно меньше памяти

### Данные для теста

Данный ввод:

deposit = {
    3: Ruble(100),
    4: Ruble(0),
    5: Ruble(0)
}
max_withdraw = {
    3: Ruble(40),
    4: Ruble(40),
    5: Ruble(40)
}
rate = Decimal('0.1')
dates = {
    3: Date(2023, 1, 10),
    4: Date(2023, 2, 10),
    5: Date(2023, 3, 10)
}


в сочетании с:

interest_iter = IterestIterator(deposit, max_withdraw, rate, dates)
for row in interest_iter:
    print(row)


должен вернуть построчно в виде <InterestInput>:

| period | date1       | date2       | deposit | max_withdraw | rate |
|--------|-------------|-------------|---------|--------------|------|
| 3      | 2023-01-10  | 2023-02-10  | 100.00  | 40.00        | 0.1  |
| 4      | 2023-02-10  | 2023-03-10  | 0.00    | 40.00        | 0.1  |
| 5      | 2023-03-10  | 2023-03-10  | 0.00    | 40.00        | 0.1  |


## Задание 2

Напишите скрипт, формирующий таблицу pandas.DataFrame.

Выходная таблица представляет собой график погашения кредита:
period date1 date2 deposit max_withdraw rate balance interest payment
| period | date1       | date2       | deposit | max_withdraw | rate | balance | interest | payment |
|--------|-------------|-------------|---------|--------------|------|---------|----------|---------|
| 1      | 2023-01-10  | 2023-02-10  | 100.00  | 40.00        | 0.1  | 100.00  | 0.85     | 40.00   |
| 2      | 2023-02-10  | 2023-03-10  | 0.00    | 40.00        | 0.1  | 60.85   | 0.47     | 40.00   |
| 3      | 2023-03-10  | 2023-04-10  | 0.00    | 40.00        | 0.1  | 21.32   | 0.18     | 21.50   |
| 4      | 2023-04-10  | 2023-04-10  | 0.00    | 0.00         | 0.1  | 0.00    | 0.00     | 0.00    |


- Входные данные совпадают с заданием 1.
- Можно использовать итератор из задания 1.
- Столбцы balance, interest и payment должны быть рассчитаны внутри скрипта.
- Проценты считаются исходя из 365 дней в году.
- Сначала происходит погашение процентов, затем основного долга.
- Решение, использующее релевантные паттерны-программирования, получит дополнительные баллы.